tap "homebrew/bundle"
tap "homebrew/core"

brew "git-delta"
brew "chezmoi"

{{- if not .codespaces }}
tap "homebrew/cask"
tap "homebrew/cask-fonts"
brew "gcc"
brew "gh"
brew "starship"
brew "terraform"
brew "tldr"
brew "tmux"
brew "vim"
brew "watch"
brew "zsh"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "spotify"
cask "visual-studio-code"

{{- if eq .location "work" }}
tap "fluxcd/tap"
tap "superbrothers/zsh-kubectl-prompt"
brew "azure-cli"
brew "go"
brew "helm"
brew "yarn"
brew "kustomize"
brew "jq"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "fluxcd/tap/flux"
brew "node"
{{- end }}

{{- end }}